---
kind: other
id: Properties.T:Autodesk.Revit.DB.ShapeBuilder
source: html/67486956-b01a-26c5-2576-5796a24a5ce3.htm
---
# ShapeBuilder Properties

Specifies whether the .NET object represents a valid Revit entity.